#include <stdio.h>
void z1();
void z2();
void z3();

int main()
{
    printf("1 задание \n");
    z1();
    printf("\n 2 задание \n");
    z2();
    printf("\n 3 задание \n");
    z3();
}
void z1()
{

printf("%d\n%d\n%d\n%d\n", 1, 2, 3, 4); // подзадание 1
printf("%10.5f\n ", 12.234657); 
printf ("Остаток от деления %d на %d равен %d\n ",5, 2, 5%2); 
printf ("Остаток от деления %d на %d равен %d\n ",7, 5, 7%5); 
printf ("%g разделить %e равно %f\n ",5., 2000000., 5./2000000);
}

void z2() {
    int N = 12, K = 55;

    printf("cейчас %d часов %d минут 00 секунд\n", N, K);
    printf("идет %d минута суток\n", N*60+K);
    printf("до полуночи осталось %d часов и %d минут\n", 23-N,60-K);
    printf("с 8.00 прошло %d секунд\n", (N - 8)*60*60+K*60);
    printf("текущий час = %.2f суток и текущая минута = %.2f часа \n", (float)N/24,(float)K/60);
}

void z3() {
    int k = 5, l = 323, n = 4, m = 1;
    printf("данные: %+d %+d\nрезультат: %+*.*f\n", n, l, k, m, (double)n / l);
}
